#Практика: Числа
#Создайте файл types.py, и сделайте в нем следующую задачу:

#a = 2
#b = ???
#print(a + b)  # задайте значение переменной b,
              # чтобы результат был 2.5

a = 2
b = 0.5
print(a + b)


#Практика: Строки

#Решите следующую задачу:

#name = 'ВСТАВЬТЕ ВАШЕ ИМЯ'
#print(???)  # сделайте так, чтобы программа 
# приветствовала вас, используя переменную name 
# и форматирование строк например "Привет, Миша!"

name = 'Дмитрий'
print(f'Привет, {name}!')



#Задание Практика: Числа

v = input('Введите число от 1 до 10: ')
print(v)

# поправьте код, чтобы выводилось число
# на 10 больше, чем введённое
# например, пользователь ввел 10 
# программа вывела 20

v = int(input('Введите число от 1 до 10: '))
print(v + 10)



#Задание Практика: Строки

#name = input('Введите ваше имя: ')
#print(???) # поправьте код, чтобы выводилась строка
 			# Привет, ИМЯ! Как дела?

name = input('Введите ваше имя: ')
print("Привет" +", " + name +"! " + "Как дела?")
print(f'Привет, {name}! Как дела?')